// Day4：条件分岐（if / else）
//条件を見て、やるかやらないかを決める門番

// 👉
// 「今 loading なら、これやれ」

// 判断役

// Yes / No を分ける

// 処理の分岐担当

const age1 = 20;

if (age1 >= 18) {
    console.log("18歳以上です");
}

// 📌 条件が true のときだけ中が実行される

// Step2｜if / else（30分）

const score1 = 60;

if(score1 >= 70) {
    console.log("合格");
} else {
    console.log("不合格");
}

// 👉 どちらか必ず実行される

// Step3｜else if（30分）
const score2 = 85;

if(score2 >= 90 ) {
    console.log("Sランク");
} else if (score2 >= 80 ){
    console.log("Aランク");
} else if(score2 >= 70 ){
    console.log("Bランク");
} else {
    console.log("Cランク");
}

// 📌 上から順に判定される
// 覚え方（これで一生防げる）
// if文の形はこれだけ
// if (条件) {
//   処理
// }

// else if (条件) {
//   処理
// }

// else {
//   処理
// }


// 📌 ) { は必ずセット
// 📌 ) ; { は存在しない


// Step4｜条件に論理演算子を使う（30分）
const age2 =20;
const isMember = true ;

if(age2 >= 18 && isMember) {
    console.log("入場できます");
} else {
    console.log("入場できません");
}


// Step5｜よくあるミス（重要）（10分）
// ❌ よくある間違い
if (age = 18) {
}

// ✅ 正しい
if (age === 18) {
}

// ✏ ミニ課題
// 課題①10以上なら「OK」

const num = 10;

if(num >= 10) {
    console.log("Ok");
}

// 課題②
// 18以上なら「大人」
// それ以外は「未成年」

const age3 = 15;

if(age3 >= 18) {
    console.log("大人");
} else{
    console.log("未成年");
}

// 課題③（重要）
// 90以上 → A

// 70以上 → B

// それ以外 → C

const score3 = 78;

if(score3 >= 90){
    console.log("A");
}else if(score3 >=70){
    console.log("B");
} else{
    console.log("C");
}

